jmx/PetersenCDP-LoginDesktop.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Petersen CDP (Individuos) - Stress Login + Desktop">
      <stringProp name="TestPlan.comments">Alcance retail ar-petersen-cdp: Login (step1 usuario / step2 password / step3 selectEnvironment auto) + Desktop individuos (loadLayout, widgets.accounts, widgets.creditCards, communications.list, misc.getBankName) + Logout. Endpoints POST /api/v1/execute/{idActivity}. Auth: exchange en step2/3, bearer post-login. Success code COR000I. Completar host y el CSV real de usuarios (extras/jmeter/usuarios-cdp.csv).</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables globales - CDP">
        <collectionProp name="Arguments.arguments">
          <elementProp name="protocol" elementType="Argument">
            <stringProp name="Argument.name">protocol</stringProp>
            <stringProp name="Argument.value">${__P(protocol,http)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">${__P(host,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.name">port</stringProp>
            <stringProp name="Argument.value">${__P(port,8080)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="apiURL" elementType="Argument">
            <stringProp name="Argument.name">apiURL</stringProp>
            <stringProp name="Argument.value">${__P(apiURL,api/v1/execute)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="channel" elementType="Argument">
            <stringProp name="Argument.name">channel</stringProp>
            <stringProp name="Argument.value">frontend</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="xAppVersion" elementType="Argument">
            <stringProp name="Argument.name">xAppVersion</stringProp>
            <stringProp name="Argument.value">${__P(xAppVersion,3.0.0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="users" elementType="Argument">
            <stringProp name="Argument.name">users</stringProp>
            <stringProp name="Argument.value">${__P(users,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="small_timer_delay" elementType="Argument">
            <stringProp name="Argument.name">small_timer_delay</stringProp>
            <stringProp name="Argument.value">${__P(smallTimerDelay,500)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="small_timer_deviation" elementType="Argument">
            <stringProp name="Argument.name">small_timer_deviation</stringProp>
            <stringProp name="Argument.value">${__P(smallTimerDeviation,200)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="medium_timer_delay" elementType="Argument">
            <stringProp name="Argument.name">medium_timer_delay</stringProp>
            <stringProp name="Argument.value">${__P(mediumTimerDelay,2000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="medium_timer_deviation" elementType="Argument">
            <stringProp name="Argument.name">medium_timer_deviation</stringProp>
            <stringProp name="Argument.value">${__P(mediumTimerDeviation,800)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="sla_max_duration_ms" elementType="Argument">
            <stringProp name="Argument.name">sla_max_duration_ms</stringProp>
            <stringProp name="Argument.value">${__P(slaMaxDurationMs,5000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="sla_accounts_duration_ms" elementType="Argument">
            <stringProp name="Argument.name">sla_accounts_duration_ms</stringProp>
            <stringProp name="Argument.value">${__P(slaAccountsDurationMs,8000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${host}</stringProp>
        <stringProp name="HTTPSampler.port">${port}</stringProp>
        <stringProp name="HTTPSampler.protocol">${protocol}</stringProp>
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
      </ConfigTestElement>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager - Content-Type">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">true</boolProp>
        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
      </CookieManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="CDP - Login + Desktop">
        <stringProp name="ThreadGroup.num_threads">${users}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampUp,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,300)}</stringProp>
        <stringProp name="ThreadGroup.delay">${__P(startDelay,0)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,-1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Usuarios CDP">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">${__P(usersFile,extras/jmeter/usuarios-cdp.csv)}</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.thread</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">user,password</stringProp>
        </CSVDataSet>
        <hashTree/>

        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="SLA - HTTP 200">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.custom_message">Se esperaba HTTP 200 en todos los requests del flujo Login+Desktop</stringProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">8</intProp>
        </ResponseAssertion>
        <hashTree/>

        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Login">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
        </TransactionController>
        <hashTree>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="SLA - Duracion maxima (login)">
            <stringProp name="DurationAssertion.duration">${sla_max_duration_ms}</stringProp>
          </DurationAssertion>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login-Paso1">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <stringProp name="Argument.value">{&#xd;
    &quot;_usuario&quot;: &quot;${user}&quot;,&#xd;
    &quot;_captcha&quot;: &quot;&quot;,&#xd;
    &quot;lang&quot;: &quot;es&quot;,&#xd;
    &quot;channel&quot;: &quot;${channel}&quot;,&#xd;
    &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;,&#xd;
    &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/${apiURL}/session.login.step1</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - exchangeToken">
              <stringProp name="JSONPostProcessor.referenceNames">exchangeToken</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.data._exchangeToken</stringProp>
              <stringProp name="JSONPostProcessor.defaultValues">NO_EXCHANGE_TOKEN</stringProp>
            </JSONPostProcessor>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="1672113791">COR000I</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Login-Paso1 no devolvio COR000I</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">16</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login-Paso2">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <stringProp name="Argument.value">{&#xd;
    &quot;_username&quot;: &quot;${user}&quot;,&#xd;
    &quot;_password&quot;: &quot;${password}&quot;,&#xd;
    &quot;_captcha&quot;: &quot;&quot;,&#xd;
    &quot;lang&quot;: &quot;es&quot;,&#xd;
    &quot;channel&quot;: &quot;${channel}&quot;,&#xd;
    &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;,&#xd;
    &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/${apiURL}/session.login.step2</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Header - exchange token (paso1)">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">exchange ${exchangeToken}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="1672113791">COR000I</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Login-Paso2 no devolvio COR000I</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">16</intProp>
            </ResponseAssertion>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - exchangeToken (refresh)">
              <stringProp name="JSONPostProcessor.referenceNames">exchangeToken</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.data._exchangeToken</stringProp>
              <stringProp name="JSONPostProcessor.defaultValues">${exchangeToken}</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login-Paso3 (SelectEnvironment - auto)">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <stringProp name="Argument.value">{&#xd;
  &quot;forceSession&quot;: false,&#xd;
  &quot;lang&quot;: &quot;es&quot;,&#xd;
  &quot;channel&quot;: &quot;${channel}&quot;,&#xd;
  &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;,&#xd;
  &quot;_fingerprint&quot;: &quot;eyJmaW5nZXJwcmludCI6ImptZXRlci1jZHAtbG9hZHRlc3QifQ==&quot;,&#xd;
  &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/${apiURL}/session.login.step3</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Header - exchange token (paso2)">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">exchange ${exchangeToken}</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="1672113791">COR000I</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">Login-Paso3 no devolvio COR000I (revisar T&amp;C pendientes -&gt; step4, o device check 2FA API580W/API581W)</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">16</intProp>
            </ResponseAssertion>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - accessToken">
              <stringProp name="JSONPostProcessor.referenceNames">accessToken</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.data._accessToken</stringProp>
              <stringProp name="JSONPostProcessor.defaultValues">NO_ACCESS_TOKEN</stringProp>
            </JSONPostProcessor>
            <hashTree/>
          </hashTree>
        </hashTree>

        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think time - post login">
          <stringProp name="ConstantTimer.delay">${small_timer_delay}</stringProp>
          <stringProp name="RandomTimer.range">${small_timer_deviation}</stringProp>
        </UniformRandomTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="BankName (anonimo)">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{&#xd;
  &quot;channel&quot;: &quot;${channel}&quot;,&#xd;
  &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/${apiURL}/misc.getBankName</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1672113791">COR000I</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">misc.getBankName no devolvio COR000I</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="SLA - Duracion maxima">
            <stringProp name="DurationAssertion.duration">${sla_max_duration_ms}</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>

        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Si Login OK (accessToken presente)">
          <stringProp name="IfController.condition">"${accessToken}" != "NO_ACCESS_TOKEN"</stringProp>
        </IfController>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Header - Authorization Bearer">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">bearer ${accessToken}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>

          <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="Escritorio">
            <boolProp name="TransactionController.includeTimers">false</boolProp>
          </TransactionController>
          <hashTree>
            <com.blazemeter.jmeter.controller.ParallelSampler guiclass="com.blazemeter.jmeter.controller.ParallelControllerGui" testclass="com.blazemeter.jmeter.controller.ParallelSampler" testname="Escritorio - llamadas en paralelo">
              <stringProp name="MAXThreadNumber">6</stringProp>
            </com.blazemeter.jmeter.controller.ParallelSampler>
            <hashTree>
              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Escritorio-DesktopLayout">
                <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                  <collectionProp name="Arguments.arguments">
                    <elementProp name="" elementType="HTTPArgument">
                      <stringProp name="Argument.value">{&#xd;
  &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;&#xd;
}</stringProp>
                      <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                  </collectionProp>
                </elementProp>
                <stringProp name="HTTPSampler.path">/${apiURL}/desktop.loadLayout</stringProp>
                <stringProp name="HTTPSampler.method">POST</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
                  <collectionProp name="Asserion.test_strings">
                    <stringProp name="1672113791">COR000I</stringProp>
                  </collectionProp>
                  <stringProp name="Assertion.custom_message">desktop.loadLayout no devolvio COR000I</stringProp>
                  <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                  <boolProp name="Assertion.assume_success">false</boolProp>
                  <intProp name="Assertion.test_type">16</intProp>
                </ResponseAssertion>
                <hashTree/>
                <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="SLA - Duracion maxima">
                  <stringProp name="DurationAssertion.duration">${sla_max_duration_ms}</stringProp>
                </DurationAssertion>
                <hashTree/>
              </hashTree>

              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Escritorio-Communications">
                <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                  <collectionProp name="Arguments.arguments">
                    <elementProp name="" elementType="HTTPArgument">
                      <stringProp name="Argument.value">{&#xd;
  &quot;direction&quot;: &quot;BANK_TO_CUSTOMER&quot;,&#xd;
  &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;&#xd;
}</stringProp>
                      <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                  </collectionProp>
                </elementProp>
                <stringProp name="HTTPSampler.path">/${apiURL}/communications.list</stringProp>
                <stringProp name="HTTPSampler.method">POST</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
                  <collectionProp name="Asserion.test_strings">
                    <stringProp name="1672113791">COR000I</stringProp>
                  </collectionProp>
                  <stringProp name="Assertion.custom_message">communications.list no devolvio COR000I</stringProp>
                  <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                  <boolProp name="Assertion.assume_success">false</boolProp>
                  <intProp name="Assertion.test_type">16</intProp>
                </ResponseAssertion>
                <hashTree/>
                <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="SLA - Duracion maxima">
                  <stringProp name="DurationAssertion.duration">${sla_max_duration_ms}</stringProp>
                </DurationAssertion>
                <hashTree/>
              </hashTree>

              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Escritorio-Widget-Cuentas">
                <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                  <collectionProp name="Arguments.arguments">
                    <elementProp name="" elementType="HTTPArgument">
                      <stringProp name="Argument.value">{&#xd;
  &quot;fromDesktop&quot;: true,&#xd;
  &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;&#xd;
}</stringProp>
                      <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                  </collectionProp>
                </elementProp>
                <stringProp name="HTTPSampler.path">/${apiURL}/widgets.accounts</stringProp>
                <stringProp name="HTTPSampler.method">POST</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
                  <collectionProp name="Asserion.test_strings">
                    <stringProp name="1672113791">COR000I</stringProp>
                  </collectionProp>
                  <stringProp name="Assertion.custom_message">widgets.accounts no devolvio COR000I</stringProp>
                  <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                  <boolProp name="Assertion.assume_success">false</boolProp>
                  <intProp name="Assertion.test_type">16</intProp>
                </ResponseAssertion>
                <hashTree/>
                <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="SLA - Duracion maxima (accounts: N consultas ISO de saldo)">
                  <stringProp name="DurationAssertion.duration">${sla_accounts_duration_ms}</stringProp>
                </DurationAssertion>
                <hashTree/>
              </hashTree>

              <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Escritorio-Widget-CreditCards">
                <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                  <collectionProp name="Arguments.arguments">
                    <elementProp name="" elementType="HTTPArgument">
                      <stringProp name="Argument.value">{&#xd;
  &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;&#xd;
}</stringProp>
                      <stringProp name="Argument.metadata">=</stringProp>
                    </elementProp>
                  </collectionProp>
                </elementProp>
                <stringProp name="HTTPSampler.path">/${apiURL}/widgets.creditCards</stringProp>
                <stringProp name="HTTPSampler.method">POST</stringProp>
                <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              </HTTPSamplerProxy>
              <hashTree>
                <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
                  <collectionProp name="Asserion.test_strings">
                    <stringProp name="1672113791">COR000I</stringProp>
                  </collectionProp>
                  <stringProp name="Assertion.custom_message">widgets.creditCards no devolvio COR000I</stringProp>
                  <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                  <boolProp name="Assertion.assume_success">false</boolProp>
                  <intProp name="Assertion.test_type">16</intProp>
                </ResponseAssertion>
                <hashTree/>
                <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="SLA - Duracion maxima">
                  <stringProp name="DurationAssertion.duration">${sla_max_duration_ms}</stringProp>
                </DurationAssertion>
                <hashTree/>
              </hashTree>
            </hashTree>

            <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think time - usuario navegando el desktop">
              <stringProp name="ConstantTimer.delay">${medium_timer_delay}</stringProp>
              <stringProp name="RandomTimer.range">${medium_timer_deviation}</stringProp>
            </UniformRandomTimer>
            <hashTree/>
          </hashTree>

          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Logout">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <stringProp name="Argument.value">{&#xd;
  &quot;ajax_uuid&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;xAppVersion&quot;: &quot;${xAppVersion}&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/${apiURL}/session.logout</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="1672113791">COR000I</stringProp>
              </collectionProp>
              <stringProp name="Assertion.custom_message">session.logout no devolvio COR000I</stringProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">16</intProp>
            </ResponseAssertion>
            <hashTree/>
            <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="SLA - Duracion maxima">
              <stringProp name="DurationAssertion.duration">${sla_max_duration_ms}</stringProp>
            </DurationAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Reporte resumen">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">${__P(summaryReportFile,)}</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">${__P(aggregateReportFile,)}</stringProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Ver Arbol de Resultados (solo debug - deshabilitado)" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>